"+ Add" = "+ Pridėti";

"Add US bank account" = "Pridėti JAV banko sąskaitą";

"Add a card" = "Pridėti kortelę";

"Add a payment method" = "Pridėkite mokėjimo būdą";

"Add bank account" = "Pridėti banko sąskaitą";

"Add card" = "Pridėti kortelę";

"Add new card" = "Pridėti naują kortelę";

"Add new payment method" = "Pridėti naują mokėjimo būdą";

"Add your payment information" = "Pridėkite mokėjimo informaciją";

"Approve payment" = "Patvirtinti mokėjimą";

"Are you sure you want to remove this card?" = "Ar tikrai norite pašalinti šią kortelę?";

"Are you sure you want to remove this linked account?" = "Ar tikrai norite pašalinti šią susietą paskyrą?";

"Back" = "Atgal";

"Bank" = "Bankas";

"Bank account" = "Banko sąskaita";

"Bank account details cannot be changed." = "Banko sąskaitos duomenų keisti negalima.";

"Buy now or pay later with  <img/>" = "Pirkite dabar arba mokėkite vėliau naudodami \"<img/>\"";

"Buy now or pay later with Afterpay" = "Pirkite dabar arba mokėkite vėliau naudodami \"Afterpay\"";

"Buy now or pay later with Cash App Afterpay" = "Pirkite dabar arba mokėkite vėliau naudodami \"Cash App Afterpay\"";

"Buy now or pay later with Clearpay" = "Pirkite dabar arba mokėkite vėliau naudodami \"Clearpay\"";

"Buy now or pay later with Klarna" = "Pirkite dabar arba mokėkite vėliau naudodami \"Klarna\"";

"Buy using a UPI ID" = "Pirkti naudojant UPI ID";

"By confirming your payment with PayPal, you allow %@ to charge your PayPal account for future payments in accordance with their terms." = "Patvirtindami savo mokėjimą \"PayPal\" leidžiate \"%@\" nuskaityti mokestį nuo jūsų \"PayPal\" sąskaitos vėlesniems mokėjimams pagal jų sąlygas.";

"By continuing to Amazon Pay, you allow %@ to charge your Amazon Pay account for future payments in accordance with their terms." = "Pereidami prie \"Amazon Pay\" leisite \"%@\" nuskaityti mokestį nuo jūsų \"Amazon Pay\" sąskaitos vėlesniems mokėjimams pagal jų sąlygas.";

"By continuing to Klarna, you allow %@ to charge your Klarna account for future payments in accordance with their terms and Klarna's terms. You can change this at any time in your Klarna app or by reaching out to %@." = "Pereidami prie \"Klarna\" leidžiate \"%1$@\" nuskaityti mokestį nuo jūsų \"Klarna\" sąskaitos vėlesniems mokėjimams pagal jų ir \"Klarna\" sąlygas. Galite bet kada tai pakeisti \"Klarna\" programėlėje arba susisiekdami su \"%2$@\".";

"By continuing to PayPal, you allow %@ to charge your PayPal account for future payments in accordance with their terms." = "Pereidami į \"PayPal\" leisite \"%@\" nuskaityti mokestį nuo jūsų \"PayPal\" sąskaitos vėlesniems mokėjimams pagal taikomas sąlygas.";

"By continuing to Revolut Pay, you allow %@ to charge your Revolut Pay account for future payments in accordance with their terms." = "Pereidami į \"Revolut Pay\" leisite %@ nuskaityti mokestį nuo jūsų \"Revolut Pay\" sąskaitos vėlesniems mokėjimams pagal taikomas sąlygas.";

"By continuing you agree to the <terms>Terms</terms> and <privacy>Privacy Policy</privacy>." = "Tęsdami sutinkate su <terms>sąlygomis</terms> ir <privacy>privatumo politika</privacy>.";

"By continuing, you agree to authorize payments pursuant to <terms>these terms</terms>." = "Tęsdami sutinkate autorizuoti mokėjimus pagal šias <terms>sąlygas</terms>.";

"By continuing, you agree to save your information for future purchases with %@ and <link>Link</link> according to Link <terms>terms</terms> and <privacy>privacy</privacy>." = "Tęsdami sutinkate išsaugoti savo informaciją būsimiems pirkimams naudojant %@ ir <link>„Link“</link> pagal „Link“ <terms>Sąlygas</terms> ir <privacy>Privatumo politiką</privacy>.";

"By continuing, you agree to save your information for future purchases with %@." = "Tęsdami sutinkate išsaugoti savo informaciją būsimiems pirkiniams naudojant %@.";

"By continuing, you authorize %@ to automatically debit your Satispay Balance on a recurring basis in accordance with your purchase or subscription plan." = "Tęsdami jūs suteikiate leidimą %@ automatiškai nurašyti lėšas nuo jūsų „Satispay Balance“ likučio periodiškai, pagal jūsų pirkimo arba prenumeratos planą.";

"By continuing, you authorize %@ to debit your Cash App account for this payment and future payments in accordance with %@'s terms, until this authorization is revoked. You can change this anytime in your Cash App Settings." = "Tęsdami įgaliojate \"%1$@\" nurašyti mokestį nuo jūsų \"Cash App\" sąskaitos už šį mokėjimą ir būsimuosius mokėjimus pagal \"%2$@\" sąlygas, kol šis įgaliojimas bus atšauktas. Galite bet kada tai pakeisti \"Cash App\" nuostatose.";

"By joining Link, you agree to the <terms>Terms</terms> and <privacy>Privacy Policy</privacy>." = "Jungdamiesi prie Link sutinkate su <terms>Sąlygomis</terms> ir <privacy>Privatumo politika</privacy>.";

"By providing phone number and email, you agree to create a Link account subject to the Link <terms>Terms</terms> and <privacy>Privacy Policy</privacy>." = "Pateikdami telefono numerį ir el. pašto adresą sutinkate susikurti „Link“ paskyrą pagal „Link“ <terms>sąlygas</terms> ir <privacy>privatumo politiką</privacy>.";

"By providing your bank account details and confirming this payment, you agree to this Direct Debit Request and the <terms>Direct Debit Request service agreement</terms>, and authorise Stripe Payments Australia Pty Ltd ACN 160 180 343 Direct Debit User ID number 507156 (“Stripe”) to debit your account through the Bulk Electronic Clearing System (BECS) on behalf of %@ (the \"Merchant\") for any amounts separately communicated to you by the Merchant. You certify that you are either an account holder or an authorised signatory on the account listed above." = "Pateikdami savo banko sąskaitos duomenis ir patvirtindami šį mokėjimą, jūs sutinkate su šiuo tiesioginio nurašymo prašymu ir <terms> tiesioginio nurašymo paslaugų teikimo sutartimi </terms> bei suteikiate leidimą bendrovei „Stripe Payments Australia Pty Ltd“ (ACN 160 180 343), tiesioginio nurašymo naudotojo ID Nr. 507156 („Stripe“), nurašyti lėšas iš jūsų sąskaitos per Bendrąją elektroninių atsiskaitymų sistemą (BECS) %@ (toliau – „Prekybininko“) vardu pagal bet kokias sumas, apie kurias jums atskirai praneš Prekybininkas. Jūs patvirtinate, kad esate šios sąskaitos savininkas arba įgaliotas (-a) ją naudoti.";

"By providing your card information, you allow %@ to charge your card for future payments in accordance with their terms." = "Pateikdami kortelės duomenis sutinkate, kad \"%@\" nuskaičiuotų nuo jūsų kortelės būsimus mokėjimus pagal jų sąlygas.";

"By providing your email, you agree to create a Link account and save your payment info to Link, according to the Link <terms>Terms</terms> and <privacy>Privacy Policy</privacy>." = "Pateikdami savo el. pašto adresą sutinkate susikurti \"Link\" paskyrą bei įrašyti savo mokėjimo informaciją į \"Link\" pagal \"Link\" <terms>sąlygas</terms> ir <privacy>privatumo politiką</privacy>.";

"By providing your payment information and confirming this payment, you authorise (A) %@ and Stripe, our payment service provider, to send instructions to your bank to debit your account and (B) your bank to debit your account in accordance with those instructions. As part of your rights, you are entitled to a refund from your bank under the terms and conditions of your agreement with your bank. A refund must be claimed within 8 weeks starting from the date on which your account was debited. Your rights are explained in a statement that you can obtain from your bank. You agree to receive notifications for future debits up to 2 days before they occur." = "Pateikdami mokėjimo duomenis ir patvirtindami šį mokėjimą, leidžiate (A) \"%@\" ir \"Stripe\" (mūsų mokėjimo paslaugų teikėjui) jūsų bankui siųsti nurodymus nurašyti pinigus iš jūsų sąskaitos ir (B) leidžiate savo bankui, gavus tokius nurodymus, nurašyti pinigus iš jūsų sąskaitos. Pagal jūsų su banku sudarytos sutarties sąlygas turite teisę iš banko reikalauti pinigų grąžinimo. Prašymą grąžinti pinigus turite pateikti per 8 savaites nuo pinigų iš jūsų sąskaitos nurašymo dienos. Jūsų teisės paaiškintos pareiškime, kurį galite gauti iš savo banko. Sutinkate gauti pranešimus apie būsimus nurašymus likus iki 2 dienų iki jų įvykdymo momento.";

"By providing your phone number, you agree to create a Link account and save your payment info to Link, according to the Link <terms>Terms</terms> and <privacy>Privacy Policy</privacy>." = "Pateikdami savo telefono numerį sutinkate susikurti \"Link\" paskyrą bei įrašyti savo mokėjimo informaciją į \"Link\" pagal \"Link\" <terms>sąlygas</terms> ir <privacy>privatumo politiką</privacy>.";

"By saving your bank account for %@ you agree to authorize payments pursuant to <terms>these terms</terms>." = "Išsaugodami savo banko sąskaitą %@, sutinkate autorizuoti mokėjimus pagal šias <terms>sąlygas</terms>.";

"By submitting your order to %@ and %@, you agree to save your information with %@ for future purchases, and agree to authorize payments pursuant to <terms>these terms</terms>." = "Pateikdami užsakymą %1$@ ir %2$@, sutinkate išsaugoti savo informaciją %3$@ būsimiems pirkiniams ir sutinkate pagal <terms>šias sąlygas</terms> autorizuoti mokėjimus.";

"By submitting your order to %@ you agree to authorize payments pursuant to <terms>these terms</terms>." = "Pateikdami užsakymą %@, sutinkate mokėjimus autorizuoti pagal <terms>šias sąlygas</terms>.";

"CPF/CPNJ" = "CPF/CPNJ";

"Cancel and pay another way" = "Atšaukti ir sumokėti kitu būdu";

"Card details cannot be changed." = "Kortelės duomenų keisti negalima.";

"Change" = "Keisti";

"Choose a payment method" = "Pasirinkite mokėjimo būdą";

"Close card scanner" = "Išjungti kortelės skaitytuvą";

"Code sent" = "Kodas išsiųstas";

"Confirm" = "Patvirtinti";

"Confirm it's you" = "Patvirtinkite, kad tai jūs";

"Confirm payment details" = "Patvirtinti mokėjimo duomenis";

"Confirm the payment in your bank or payment app within %@ to complete the purchase." = "Patvirtinkite mokėjimą banke ar programėlėje per %@ ir užbaikite pirkimą.";

"Confirm the payment in your bank's app within %@ to complete the purchase." = "Patvirtinkite mokėjimą savo banko programėlėje per %@ ir užbaikite pirkimą.";

"Confirm your CVC" = "Patvirtinkite savo CVC";

"Contact information" = "Kontaktinė informacija";

"Continue another way" = "Tęsti kitu būdu";

"Create an account with Link for faster checkout across the web" = "Sukurkite paskyrą naudodami „Link”, kad galėtumėte greičiau atsiskaityti žiniatinklyje";

"Debit or credit card" = "Debeto arba kredito kortelė";

"Default" = "Numatytasis";

"Default payment method" = "Numatytasis mokėjimo būdas";

"Did you mean %@? %@." = "Ar norėjote %1$@? %2$@.";

"EPS Bank" = "EPS bankas";

"Enter address manually" = "Įvesti adresą rankiniu būdu";

"Enter the code sent to %@." = "Įveskite kodą, išsiųstą %s.";

"FPX Bank" = "FPX bankas";

"Failed to connect" = "Nepavyko prisijungti";

"Fast, secure checkout" = "Greitas ir saugus pirkimo užbaigimas";

"Get %@ back when you pay for the first time with your bank. <terms>See terms</terms>" = "Atgaukite %@ pirmą kartą mokėdami per savo banką. <terms>Žr. sąlygas</terms>";

"Get %@ back when you pay with your bank. <terms>See terms</terms>" = "Atgaukite %@ mokėdami per savo banką. <terms>Žr. sąlygas</terms>";

"I understand that Stripe will be collecting Direct Debits on behalf of %@ and confirm that I am the account holder and the only person required to authorise debits from this account." = "Suprantu, kad \"Stripe\" atliks tiesioginio debeto nuskaitymus \"%@\" vardu ir patvirtinu, kad esu sąskaitos turėtojas bei vienintelis asmuo, galintis leisti atlikti debeto nuskaitymus nuo šios sąskaitos.";

"IBAN" = "IBAN";

"Log in or sign up" = "Prisijungti arba prisiregistruoti";

"Log out of Link" = "Atsijungti nuo \"Link\"";

"Manage SEPA debit" = "Tvarkyti SEPA debetą";

"Manage US bank account" = "Tvarkyti JAV banko sąskaitą";

"Manage bank account" = "Tvarkyti banko sąskaitą";

"Manage card" = "Tvarkyti kortelę";

"Manage cards" = "Tvarkyti korteles";

"Manage payment method" = "Tvarkyti mokėjimo būdą";

"Manage payment methods" = "Valdyti mokėjimo būdus";

"Manage your payment methods" = "Valdykite savo mokėjimo būdus";

"Name on card" = "Ant kortelės nurodytas vardas ir pavardė";

"New card" = "Nauja kortelė";

"New payment method" = "Naujas mokėjimo būdas";

"No %@ promo" = "Nėra %@ akcijos";

"Not you?" = "Ne jūs?";

"Only card brand can be changed." = "Galima keisti tik kortelės prekės ženklą.";

"Open your UPI app to approve your payment within %@" = "Atidarykite savo UPI programą mokėjimui patvirtinti per %@";

"Or" = "Arba";

"Or pay using" = "Arba mokėti naudojant";

"Or pay with a card" = "Arba mokėti kortele";

"Or use" = "Arba naudokite";

"Or use a card" = "Arba naudokite kortelę";

"Pay %@" = "Mokėti %@";

"Pay another way" = "Mokėkite kitu būdu";

"Pay faster at %@ and thousands of businesses." = "Mokėkite greičiau \"%@\" ir daugybei kitų įmonių.";

"Pay faster everywhere Link is accepted." = "Mokėkite greičiau visur, kur priimama „Link“.";

"Pay over time with %@" = "Mokėkite vėliau naudodami %@";

"Pay over time with Affirm" = "Mokėkite per tam tikrą laikotarpį naudodami \"Affirm\"";

"Pay with Link" = "Mokėti naudojant \"Link\"";

"Pay with your bank account in just a few steps." = "Mokėkite naudodami savo banko sąskaitą vos keliais veiksmais.";

"Payment" = "Mokėjimas";

"Payment failed" = "Sumokėti nepavyko";

"Payment methods" = "Mokėjimo būdai";

"Please choose a valid payment method." = "Pasirinkite galiojantį mokėjimo būdą.";

"Please go back and select another payment method" = "Grįžkite atgal ir pasirinkite kitą mokėjimo būdą";

"Point the camera at your card." = "Nukreipkite fotoaparatą į kortelę.";

"Processing..." = "Apdorojama...";

"Przelewy24 Bank" = "Bankas \"Przelewy24\"";

"Remove card?" = "Ištraukti kortelę?";

"Remove linked account" = "Pašalinti susietą paskyrą";

"Resend code" = "Pakartotinai siųsti kodą";

"SEPA debit details cannot be changed." = "SEPA debeto duomenų keisti negalima.";

"Save" = "Išsaugoti";

"Save a new payment method" = "Išsaugoti naują mokėjimo būdą";

"Save address" = "išsaugoti adresą";

"Save for future payments" = "Išsaugokite vėlesniems mokėjimams";

"Save my info for faster checkout with Link" = "Išsaugoti mano informaciją greitesniam atsiskaitymui su „Link“";

"Save payment details to %@ for future purchases" = "Išsaugoti mokėjimo duomenis \"%@” būsimiems pirkimams";

"Save this account for future %@ payments" = "Išsaugoti šią sąskaitą vėlesniems %@ mokėjimams";

"Save your bank account in just a few steps." = "Vos keliais veiksmais įrašykite savo banko sąskaitą.";

"Save your info for secure 1-click checkout with Link" = "Išsaugokite savo informaciją saugiam atsiskaitymui vienu spustelėjimu su \"Link\"";

"Saved" = "Įrašyta";

"Select card" = "Pasirinkti kortelę";

"Select payment method" = "Pasirinkti mokėjimo būdą";

"Select your payment method" = "Pasirinkite mokėjimo būdą";

"Set as default" = "Nustatyti kaip numatytąjį";

"Set as default payment method" = "Nustatyti kaip numatytąjį mokėjimo būdą";

"Set up" = "Nustatyti";

"Shipping to %@ is not supported." = "Siuntimas į %@ nepalaikomas.";

"Show menu" = "Rodyti meniu";

"Simple, secure one-click payments" = "Paprasti ir saugūs mokėjimai vienu spustelėjimu";

"Something went wrong when linking your account.\nPlease try again later." = "Susiejant paskyrą kažkas nepavyko.\n Bandykite dar kartą vėliau.";

"Stripe will deposit $0.01 to your account in 1-2 business days. Then you'll get an email with instructions to finish saving your bank account with %@." = "Per 1–2 darbo dienas \"Stripe\" į jūsų sąskaitą įneš 0,01 USD. Tada gausite el. laišką su nurodymais, kaip baigti įrašyti savo banko sąskaitą naudojant \"%@\".";

"Stripe will deposit $0.01 to your account in 1-2 business days. Then you’ll get an email with instructions to complete payment to %@." = "Po 1–2 darbo dienas \"Stripe\" į jūsų sąskaitą įneš 0,01 USD. Tada gausite el. laišką su nurodymais, kaip užbaigti mokėjimą %@.";

"Tap to close" = "Bakstelėkite, kad uždarytumėte";

"Tap to expand" = "Bakstelėkite, kad išplėstumėte";

"The IBAN you entered is incomplete." = "Įvedėte ne visą IBAN.";

"The IBAN you entered is invalid, \"%@\" is not a supported country code." = "Jūsų įvestas IBAN yra neteisingas, „%@“ nėra palaikomas šalies kodas.";

"The provided verification code has expired." = "Pateiktas patvirtinimo kodas nebegalioja.";

"The provided verification code is incorrect." = "Nurodytas neteisingas patikrinimo kodas.";

"This is your default" = "Tai jūsų numatytasis mokėjimo būdas";

"This payment method will be removed but will remain available for %@ subscriptions." = "Šis mokėjimo būdas bus pašalintas, tačiau ir toliau bus galima naudotis %@ prenumeratomis.";

"Too many attempts. Please try again in a few minutes." = "Per daug bandymų. Bandykite dar kartą po kelių minučių.";

"Unavailable for this purchase" = "Šiam pirkiniui nepasiekiama";

"Update card" = "Atnaujinti kortelę";

"Update payment method" = "Atnaujinti mokėjimo būdą";

"Use billing address for shipping" = "Atsiskaitymo adresą naudoti siuntimui";

"View more" = "Peržiūrėti daugiau";

"Yes, update" = "Taip, atnaujinti";

"Your IBAN should start with a two-letter country code." = "Jūsų IBAN turėtų prasidėti šalies kodu iš dviejų raidžių.";

"iDEAL Bank" = "iDEAL bankas";
